[
  {
  	"id": 0,
  	"title": "Nreca.coop Becomes Electric.coop", 
  	"image": "http://laurawitherspoon.com/images/Electric_coop.png",
  	"description": "NRECA.coop was NRECAs public facing website, which provided information on its various research programs, initiatives, recent news, and organizational structure. After a major initiative to update the website content strategy, designs for a new website were contracted. I was one of two developers on the project to implement the designs by creating a custom WordPress theme from scratch. We crafted all the PHP templates to be inline with the requirements of the designs. The PHP templates involved using custom post types, fields, content types and queries to organize the content according to the new content strategy. We used the following resources to assist with development: MAMP, Sass (CSS pre-processor), Grunt (auto task runner), and NPM.",
  	"url": "https://www.electric.coop",
  	"tag": "Web Development"
  },
  {
  	"id": 1,
  	"title": "Cooperative.com Redesign",
  	"image": "http://laurawitherspoon.com/images/Cooperative_com.png",
  	"altImages": [
  	  {
  	    "url": "http://laurawitherspoon.com/images/Coop_events-section.png",
  	    "caption": "Custom designed education and training page displaying a dynamic view of current and future events using a RESTful API."
  	  },
  	  {
  	    "url": "http://laurawitherspoon.com/images/Coop_video-section.png",
  	    "caption": "Video library displaying dynamic listing of individual video pages."
  	  }
  	  ],
  	"description": "Cooperative.com is an extensive members-only website that houses a variety of informational/educational materials for electric cooperatives. This project involved re-building the site from scratch while migrating it to SharePoint 2013. I primarily contributed to building its master pages, page layouts, stylesheets and custom scripts. I also migrating content and led the redesign of the main education and training section, which is a dynamic view of current and future events, integrated using RESTful API with our membership database system.",
  	"url": "https://www.cooperative.com",
  	"tag": "Web Development"
  },
  {
    "id": 2,
    "title": "Knowland Website Redesign",
    "image": "http://laurawitherspoon.com/images/website_process.png",
    "description": "This a step-by-step walkthrough of my typical website design process.",
    "url": "http://laurawitherspoon.com/images/Website_Process.pdf",
    "tag": "Web Development"
  },
  {
  	"id": 3,
  	"title": "Product Enhancement Ad",
  	"image": "http://laurawitherspoon.com/images/KU_topspot2.jpg",
    "altImages": null,
    "description": null,
    "url": null,
  	"tag": "Graphic Design"
  },
  {
    "id": 4,
    "title": "Hire Veterans HR Initiative Website",
    "image": "http://laurawitherspoon.com/images/ServeVets.png",
    "altImages": [
      {
        "url": "http://laurawitherspoon.com/images/ServeVets_for-veterans-section.png",
        "caption": null
      },
      {
        "url": "http://laurawitherspoon.com/images/ServeVets_program-section.png",
        "caption": null
      }
    ],
    "description": "This website was an HR initiative designed to promote the Serve Our Co-ops; Serve Our Country program, which focuses on educating and training co-ops to implement nationally recognized leading practices in attracting, hiring, onboarding and retaining veterans. This site is built in WordPress using a customized theme and styles.",
    "url": "http://www.servevets.coop/",
    "tag": "Web Development"
  },
  {
    "id": 5,
    "title": "TechAdvantage Conference Website",
    "image": "http://laurawitherspoon.com/images/TechAdvantage.png",
    "altImages": [
      {
        "url": "http://laurawitherspoon.com/images/TA_learning-labs-section.png",
        "caption": null
      },
      {
        "url":"http://laurawitherspoon.com/images/TA_event-info-section.png",
        "caption": null
      }
    ],
    "description": "The TechAdvantage website is for an annually recurring conference hosted by NRECA and a variety of sponsors. This website is built in WordPress and is highly customized with custom post types, templates, and styles and is designed to be easily updated every year based on changing branding requirements.",
    "url": "http://www.techadvantage.org/",
    "tag": "Web Development"
  },
  {
  	"id": 6,
  	"title": "HyperV Technologies Website",
  	"image": "http://laurawitherspoon.com/images/hyperv_screenshot.png",
  	"altImages": null,
  	"description": "The HyperV website project was a re-imagining of their face to the public. I analyzed and re-evaluated the goals, audiences, and maintenance plan for the website and determined that a custom WordPress site fit the bill. As a scientific research business, highlighting their current and past resaearch projects, publications, and collaborators became a primary goal. The color scheme and design aimed to bring sophistication and simplicity to an otherwise detailed and highly specific website.",
  	"url": "http://www.hyperv.com",
  	"tag": "Web Development"
  },
  {
    "id": 7,
    "title": "Acumatica Moves To Expression Engine",
    "image": "http://laurawitherspoon.com/images/acumatica_full.png",
    "thumbnail": "http://laurawitherspoon.com/images/acumatica_homepage.png",
    "altImages": null,
    "description": "Acumatica's transition to a content management system went hand in hand with a full company rebrand, including a website redesign. This redesign focused on mobile optimization and engaging graphics. NOTE: The site has been updated since this project.",
    "url": "http://www.acumatica.com/",
    "tag": "Web Development"
  },
  {
    "id": 8,
    "title": "Product Fact-Sheet",
    "image": "http://laurawitherspoon.com/images/tn_mobile_ss.png",
    "altImages": null,
    "description": null,
    "url": null,
    "tag": "Graphic Design"
  },
  {
    "id": 9,
    "title": "Website Promotional Flyer",
    "image": "http://laurawitherspoon.com/images/govt_webinar_ss.png",
    "altImages": null,
    "description": null,
    "url": null,
    "tag": "Graphic Design"
  }
]